{
    "masters_courses":
    [
        {
            "id": "ADS",
            "title": "Applied data science",
            "description" : "This module focused on the data science pipeline, covering data acquisition, preparation, and analysis using Python and its libraries. It focused on statistical and machine learning techniques, big data technologies, professional report creation, and ethical considerations in data science.",
            "show_home": 1
        },
        {
            "id": "ML1",
            "title": "Machine learning 1",
            "description": "This module introduced machine learning fundamentals, including optimization, unsupervised learning (e.g., k-means, PCA), and discriminative methods for classification and regression. It covered parametric models (e.g., linear models, decision trees), non-parametric models (e.g., k-nearest neighbors), and ensemble methods like boosting. The module gave a strong focus on applying these techniques to solve data-driven problems, emphasizing algorithmic thinking and practical implementation.",
            "show_home": 1
        },
        {
            "id": "STFDS",
            "title": "Software technologies for data science",
            "description": "This module focused on Python programming, leveraging libraries like NumPy and Scikit-learn for data science tasks. It also covered SQL for database management, REST APIs, and scalable technologies for 'Big Data' applications. Emphasis was placed on integrating software tools with data structures and computation to develop efficient, scalable solutions.",
            "show_home": 1
        },
        {
            "id": "SFDS",
            "title": "Statistics for data science",
            "description": "This module provided foundational knowledge in probability and statistics, covering random variables, Bayes' Theorem, expectation, variance, common distributions, hypothesis testing, and confidence intervals. The module gave a focus on translating real-world problems into statistical frameworks, performing analyses, and critically interpreting results in practical data science scenarios.",
            "show_home": 1
        },
        {
            "id": "Ent",
            "title": "Entrepreneurship",
            "description": "This module focused on transforming ideas into viable business propositions, covering market analysis, corporate structure, funding, hiring, operations, and marketing. It emphasized risk management, legal, social, ethical, and professional considerations, along with intellectual property rights. The module also explored entrepreneurial resources and strategies while providing practical skills for crafting comprehensive business plans, blending historical entrepreneurial perspectives with modern business planning techniques.",
            "show_home": 0
        },
        {
            "id": "RPP",
            "title": "Research project preparation",
            "description": "This module focused on preparing for the dissertation, including conducting a detailed literature review, critically analyzing research papers, and assessing resource quality. The module gave emphasis to developing a structured research proposal, scientific writing, conceptual reviews, and dissertation planning. Collaboration with project advisors was prioritized to outline a feasible and impactful research project.",
            "show_home": 0
        },
        {
            "id": "ML2",
            "title": "Machine learning 2",
            "description": "This module explored advanced machine learning topics, including ensemble methods, natural language processing (NLP), and deep learning models such as MLPs, CNNs, RNNs, GANs, attention mechanisms, and transformers. The module gave emphasis to developing and evaluating models for real-world problems, implementing inference algorithms, and addressing uncertainty in predictions. Practical skills in advanced implementations and technical report writing were key focuses, alongside critical analysis of state-of-the-art approaches.",
            "show_home": 1
        },
        {
            "id": "RL",
            "title": "Reinforcement learning",
            "description": "This module introduced reinforcement learning concepts, covering dynamic programming, Monte Carlo methods, temporal-difference algorithms, value function approximation, policy gradient methods, and the integration of planning and learning. It emphasized formulating problems with defined state and action spaces and designing reward functions. The module also focused on evaluating solution methods, addressing challenges in complex problem-solving, and developing algorithmic thinking for sequential decision-making under uncertainty.",
            "show_home": 1
        },
        {
            "id": "Diss",
            "title": "Dissertation",
            "description": "Optimal Pathfinding and Execution Strategies for Micromouse Maze Navigation",
            "details": "This dissertation focused on enhancing Micromouse maze navigation by comparing classical algorithms such as BFS and FloodFill with reinforcement learning methods like Q-Learning and Dyna-Q. A novel time-based reward structure was introduced, prioritizing traversal speed over path distance. The multi-agent approach combining time-based algorithms achieved optimal pathfinding in 80.9% of 491 mazes. The research highlights the importance of balancing execution time and path efficiency in competitive maze-solving scenarios."
        }          
    ]
}